#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.kubernetes_ingress.foreign_language_reader_ingress will be created
  + resource "kubernetes_ingress" "foreign_language_reader_ingress" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class"             = "nginx"
              + "nginx.ingress.kubernetes.io/enable-cors" = "true"
            }
          + generation       = (known after apply)
          + name             = "foreign-language-reader-ingress"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "api.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "api"
                          + service_port = "4000"
                        }
                    }
                }
            }
          + rule {
              + host = "language.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "language-service"
                          + service_port = "8000"
                        }
                    }
                }
            }
          + rule {
              + host = "kibana.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "kibana-kibana"
                          + service_port = "5601"
                        }
                    }
                }
            }

          + tls {
              + secret_name = "nginx-certificate"
            }
        }
    }

  # module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "api_autoscale" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "api"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = 75

          + scale_target_ref {
              + kind = "Deployment"
              + name = "api"
            }
        }
    }

  # module.infrastructure.module.api.kubernetes_service.api will be created
  + resource "kubernetes_service" "api" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "api"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "api"
            }
          + session_affinity            = "None"
          + type                        = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 4000
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
        }
    }

  # module.infrastructure.module.container_registries.helm_release.ecr_cred_refresher_default["content"] must be replaced
-/+ resource "helm_release" "ecr_cred_refresher_default" {
        atomic                     = false
        chart                      = "aws-ecr-credential"
        cleanup_on_fail            = false
        dependency_update          = false
        disable_crd_hooks          = false
        disable_openapi_validation = false
        disable_webhooks           = false
        force_update               = false
      ~ id                         = "ecr-cred-refresher-content" -> (known after apply)
        max_history                = 0
      ~ metadata                   = [
          - {
              - chart     = "aws-ecr-credential"
              - name      = "ecr-cred-refresher-content"
              - namespace = "ecrcredrefresh"
              - revision  = 1
              - values    = jsonencode(
                    {
                      - aws             = {
                          - accessKeyId     = "QUtJQVFSS0VKR1RQR1hSV0FISDY="
                          - account         = "037187302622"
                          - region          = "us-west-2"
                          - secretAccessKey = "OFhXYTNWQURuQnNwUHVSQ0FFZW52VUY3Q0drUTEzYnZGTEwwREs2aw=="
                        }
                      - targetNamespace = "content"
                    }
                )
              - version   = "1.4.2"
            },
        ] -> (known after apply)
        name                       = "ecr-cred-refresher-content"
      ~ namespace                  = "ecrcredrefresh" -> "default" # forces replacement
        recreate_pods              = false
        render_subchart_notes      = true
        replace                    = false
        repository                 = "https://architectminds.github.io/helm-charts/"
        reset_values               = false
        reuse_values               = false
        skip_crds                  = false
        status                     = "deployed"
        timeout                    = 300
        verify                     = false
        version                    = "1.4.2"
        wait                       = true

        set {
            name  = "aws.region"
            value = "us-west-2"
        }
        set {
            name  = "targetNamespace"
            value = "content"
        }

        set_sensitive {
            name  = "aws.accessKeyId"
            value = (sensitive value)
        }
        set_sensitive {
            name  = "aws.account"
            value = (sensitive value)
        }
        set_sensitive {
            name  = "aws.secretAccessKey"
            value = (sensitive value)
        }
    }

  # module.infrastructure.module.container_registries.helm_release.ecr_cred_refresher_default["default"] must be replaced
-/+ resource "helm_release" "ecr_cred_refresher_default" {
        atomic                     = false
        chart                      = "aws-ecr-credential"
        cleanup_on_fail            = false
        dependency_update          = false
        disable_crd_hooks          = false
        disable_openapi_validation = false
        disable_webhooks           = false
        force_update               = false
      ~ id                         = "ecr-cred-refresher-default" -> (known after apply)
        max_history                = 0
      ~ metadata                   = [
          - {
              - chart     = "aws-ecr-credential"
              - name      = "ecr-cred-refresher-default"
              - namespace = "ecrcredrefresh"
              - revision  = 1
              - values    = jsonencode(
                    {
                      - aws             = {
                          - accessKeyId     = "QUtJQVFSS0VKR1RQR1hSV0FISDY="
                          - account         = "037187302622"
                          - region          = "us-west-2"
                          - secretAccessKey = "OFhXYTNWQURuQnNwUHVSQ0FFZW52VUY3Q0drUTEzYnZGTEwwREs2aw=="
                        }
                      - targetNamespace = "default"
                    }
                )
              - version   = "1.4.2"
            },
        ] -> (known after apply)
        name                       = "ecr-cred-refresher-default"
      ~ namespace                  = "ecrcredrefresh" -> "default" # forces replacement
        recreate_pods              = false
        render_subchart_notes      = true
        replace                    = false
        repository                 = "https://architectminds.github.io/helm-charts/"
        reset_values               = false
        reuse_values               = false
        skip_crds                  = false
        status                     = "deployed"
        timeout                    = 300
        verify                     = false
        version                    = "1.4.2"
        wait                       = true

        set {
            name  = "aws.region"
            value = "us-west-2"
        }
        set {
            name  = "targetNamespace"
            value = "default"
        }

        set_sensitive {
            name  = "aws.accessKeyId"
            value = (sensitive value)
        }
        set_sensitive {
            name  = "aws.account"
            value = (sensitive value)
        }
        set_sensitive {
            name  = "aws.secretAccessKey"
            value = (sensitive value)
        }
    }

  # module.infrastructure.module.container_registries.kubernetes_namespace.ecr_cred_refresher will be destroyed
  - resource "kubernetes_namespace" "ecr_cred_refresher" {
      - id = "ecrcredrefresh" -> null

      - metadata {
          - annotations      = {
              - "name" = "ecrcredrefresh"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "ecrcredrefresh" -> null
          - resource_version = "1063384" -> null
          - self_link        = "/api/v1/namespaces/ecrcredrefresh" -> null
          - uid              = "da9a1795-a92a-4609-948c-aef2149f16a5" -> null
        }
    }

  # module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "language_service_autoscale" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = 75

          + scale_target_ref {
              + kind = "Deployment"
              + name = "language-service"
            }
        }
    }

  # module.infrastructure.module.language_service.kubernetes_service.language_service will be created
  + resource "kubernetes_service" "language_service" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "language-service"
            }
          + session_affinity            = "None"
          + type                        = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 8000
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "api"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["kibana"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "kibana"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["language"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "language"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

Plan: 10 to add, 0 to change, 3 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
